АПК/DataProcessors/ТаймерРабочегоВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ТаймерРабочегоВремени</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

АПК/InformationRegisters/УчетРабочегоВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>УчетРабочегоВремени</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипЗаписи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипЗаписиВремени</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:TaskRef.Задача</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

АПК/Enums/ТипЗаписиВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипЗаписиВремени</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РабочийДень</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Задача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перерыв</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

АПК/DataProcessors/ТаймерРабочегоВремени/Forms/Форма/Ext/Form/Module.bsl
#Область Переменные

&НаКлиенте
Перем ТекущееВремяСтарта;

#КонецОбласти

#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	// Загружаем активную сессию если есть
	ЗагрузитьАктивнуюСессию();
	
	Администратор		= "Добрынин Андрей Дмитриевич";
	ТекущийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь().ПолноеИмя;
	
	Если РольДоступна("ПолныеПрава") И ТекущийПользователь = Администратор Тогда 
		Элементы.Таймер.Видимость = Истина;
	Иначе 
		Элементы.Таймер.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Не ТаймерАктивен Тогда 
		Возврат;
	КонецЕсли;
	
	Если ЗавершениеРаботы Тогда 
		НажатьСтоп(Неопределено);
	КонецЕсли;
	
	ТекстПредупреждения = "Таймер ещё запущен. Остановить и сохранить перед закрытием?";
	Отказ = Истина;
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект),
        ТекстПредупреждения,
        РежимДиалогаВопрос.ДаНет,
        0,
        КодВозвратаДиалога.Да
    );
	
КонецПроцедуры

#КонецОбласти

#Область Команды

&НаКлиенте
Процедура НажатьСтарт(Команда)
	
	Перерыв = ПолучитьТипПерерыв();
	
    Если ТаймерАктивен Тогда
		
		Предупреждение("Таймер уже запущен!");
		
		Возврат;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущийТип) Тогда 
		
		Предупреждение("Заполните тип таймера!");
		
		Возврат;
		
	КонецЕсли;
	
	Если ТекущийТип = Перерыв Тогда 
		
		Предупреждение("Тип таймера ""Перерыв"" заполняется автоматически!");
		
		Возврат;
		
	КонецЕсли;
    
    ТекущееВремяСтарта = ТекущаяДата();
    СтартВремени = ТекущееВремяСтарта;
    
    СохранитьЗапись(ТекущееВремяСтарта, '0001-01-01', ТекущийТип, ТекущаяЗадача, ТекущийКомментарий);
    
    ТаймерАктивен = Истина;
    ПодключитьОбработчикОжидания("ОбновитьТаймер", 1);
    
    ОбновитьИсториюНаСервере();
	
	Элементы.НажатьСтарт.Видимость = Ложь;
    
КонецПроцедуры

&НаКлиенте
Процедура НажатьСтоп(Команда)
    
    Если Не ТаймерАктивен Тогда
		
		Предупреждение("Таймер не запущен.");
		
		Возврат;
		
	КонецЕсли;
    
    ВремяОкончания = ТекущаяДата();
    
    ЗакрытьАктивнуюЗапись(СтартВремени, ВремяОкончания);
    
    ТаймерАктивен = Истина; // сбрасываем
    ОтключитьОбработчикОжидания("ОбновитьТаймер");
    ТаймерАктивен = Ложь;
    ТекущееВремяОтображения = "00:00:00";
    
    ОбновитьИсториюНаСервере();
	
	Элементы.НажатьСтарт.Видимость 		 = Истина;
	Элементы.НажатьВозобновить.Видимость = Ложь;
    
КонецПроцедуры

&НаСервере
Функция НажатьПерерывНаСервере()
	
	ТекущийТип = Перечисления.ТипЗаписиВремени.Перерыв;
	
	Возврат ТекущийТип;
	
КонецФункции

&НаКлиенте 
Процедура НажатьПерерыв(Команда)
    
    Если Не ТаймерАктивен Тогда
		
		Предупреждение("Сначала запустите таймер.");
		
		Возврат;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущийТип) Тогда 
		
		Предупреждение("Сначала заполните тип таймера!");
		
		Возврат;
		
	КонецЕсли;
	
    ВремяОкончания = ТекущаяДата();
    ЗакрытьАктивнуюЗапись(СтартВремени, ВремяОкончания);
    
    // Запоминаем предыдущий тип чтобы потом восстановить
    ПредыдущийТип = ТекущийТип;
    
    НовыйСтарт = ТекущаяДата();
    СтартВремени = НовыйСтарт;
    ТекущийТип = ПолучитьТипПерерыв();
    
    СохранитьЗапись(НовыйСтарт, '0001-01-01', ТекущийТип, "", "Перерыв");
	
	Элементы.НажатьСтарт.Видимость = Ложь;
	Элементы.НажатьВозобновить.Видимость = Истина;
    
    ОбновитьИсториюНаСервере();
    
КонецПроцедуры

&НаКлиенте
Процедура НажатьВозобновить(Команда)
	
	Перерыв = ПолучитьТипПерерыв();
	
    Если Не ТаймерАктивен Тогда
		
		Предупреждение("Таймер не запущен.");
		
		Возврат;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущийТип) Тогда 
		
		Предупреждение("Сначала заполните тип таймера!");
		
		Возврат;
		
	КонецЕсли;
	
	Если ТекущийТип = Перерыв Тогда 
		
		Предупреждение("Тип таймера ""Перерыв"" заполняется автоматически!"
		+ Символы.ПС + "Смените тип таймера на актуальный");
		
		Возврат;
		
	КонецЕсли;
    	
	Если ТекущийТип = ПредыдущийТип Тогда 
		
		СписокЗначений = ПолучитьСписокТипов();
		
		ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ВозобновитьПослеВыбораТипа", ЭтотОбъект),
		СписокЗначений, Элементы.ТекущийТип);
		
	Иначе 
		
		ВозобновитьСТипом(ПредыдущийТип);
		
	КонецЕсли;	
        
КонецПроцедуры

#КонецОбласти

#Область РаботаОбработки

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    Если Результат = КодВозвратаДиалога.Да Тогда
		
		НажатьСтоп(Неопределено);
        Закрыть();
		
	КонецЕсли;
    
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьАктивнуюСессию()
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ ПЕРВЫЕ 1
    |    УРВ.ВремяНачала,
    |    УРВ.ТипЗаписи,
    |    УРВ.Задача,
    |    УРВ.Комментарий
    |ИЗ
    |    РегистрСведений.УчетРабочегоВремени КАК УРВ
    |ГДЕ
    |    УРВ.Пользователь = &Пользователь
    |    И УРВ.Дата = &Дата
    |    И УРВ.ВремяОкончания = ДАТАВРЕМЯ(1, 1, 1)
    |УПОРЯДОЧИТЬ ПО
    |    УРВ.ВремяНачала УБЫВ";
    
    Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийСотрудник);
    Запрос.УстановитьПараметр("Дата", НачалоДня(ТекущаяДата()));
    
    Результат = Запрос.Выполнить();
    
	Если Не Результат.Пустой() Тогда
		
        Выборка = Результат.Выбрать();
        Выборка.Следующий();
        
        СтартВремени        = Выборка.ВремяНачала;
        ТекущийТип          = Выборка.ТипЗаписи;
        ТекущаяЗадача       = Выборка.Задача;
        ТекущийКомментарий  = Выборка.Комментарий;		
		ТаймерАктивен       = Истина;
		
	КонецЕсли;
    
    // Загружаем историю за сегодня
    ОбновитьИсториюНаСервере();
    
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТаймер()
    
    Если Не ТаймерАктивен Тогда
        Возврат;
    КонецЕсли;
    
    Прошло = ТекущаяДата() - СтартВремени;
    
    Часы	= Цел(Прошло / 3600);
    Минуты  = Цел((Прошло - Часы * 3600) / 60);
    Секунды = Прошло - Часы * 3600 - Минуты * 60;
    
    ТекущееВремяОтображения = 
        Формат(Часы,   "ЧЦ=2; ЧВН=") + ":" +
        Формат(Минуты, "ЧЦ=2; ЧВН=") + ":" +
        Формат(Секунды,"ЧЦ=2; ЧВН=");
		
		
	Оповестить("ОбновитьТаймерНаГлавной", ТекущееВремяОтображения);
    
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СохранитьЗапись(ВремяНачала, ВремяОкончания, ТипЗаписи, Задача, Комментарий)
    
    НаборЗаписей = РегистрыСведений.УчетРабочегоВремени.СоздатьНаборЗаписей();
    
    // Для независимого регистра — добавляем новую запись
    Запись = НаборЗаписей.Добавить();
    Запись.Пользователь      = ПараметрыСеанса.ТекущийСотрудник;
    Запись.Дата              = НачалоДня(ВремяНачала);
    Запись.ВремяНачала       = ВремяНачала;
    Запись.ВремяОкончания    = ВремяОкончания;
    Запись.ТипЗаписи         = ТипЗаписи;
    Запись.Задача            = Задача;
    Запись.Комментарий       = Комментарий;
    Запись.Длительность      = 0;
    
    НаборЗаписей.Записать(Ложь); // Ложь = добавить, не перезаписывать
    
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗакрытьАктивнуюЗапись(ВремяНачала, ВремяОкончания)
	
	// ++ Демо вариант через запрос
	
	//// Находим запись без времени окончания и закрываем её
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ ПЕРВЫЕ 1
	//|    УРВ.НомерСтроки
	//|ИЗ
	//|    РегистрСведений.УчетРабочегоВремени КАК УРВ
	//|ГДЕ
	//|    УРВ.Пользователь = &Пользователь
	//|    И УРВ.ВремяНачала = &ВремяНачала
	//|    И УРВ.ВремяОкончания = ДАТАВРЕМЯ(1, 1, 1)";
	//
	//Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийСотрудник);
	//Запрос.УстановитьПараметр("ВремяНачала", ВремяОкончания);
	
	// -- Демо вариант через запрос
	
    // Обновляем через менеджер записи
    МенеджерЗаписи = РегистрыСведений.УчетРабочегоВремени.СоздатьМенеджерЗаписи();
    МенеджерЗаписи.Пользователь   = ПараметрыСеанса.ТекущийСотрудник;
    МенеджерЗаписи.ВремяНачала    = ВремяНачала;
	МенеджерЗаписи.Дата			  = НачалоДня(ВремяНачала);
	
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран() Тогда 
		
		МенеджерЗаписи.ВремяОкончания = ВремяОкончания;
		МенеджерЗаписи.Длительность	  = ВремяОкончания - ВремяНачала;
		
		МенеджерЗаписи.Записать();
		
	Иначе 
		ВызватьИсключение("Активная запись не найдена!");
	КонецЕсли;
	
	//МенеджерЗаписи.ВремяОкончания = ВремяОкончания;
	//МенеджерЗаписи.Длительность   = ВремяОкончания - ВремяНачала;
	//МенеджерЗаписи.Записать();
    
КонецПроцедуры

&НаСервере
Процедура ОбновитьИсториюНаСервере()
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    УРВ.ВремяНачала,
    |    УРВ.ВремяОкончания,
    |    УРВ.ТипЗаписи КАК Тип,
    |    УРВ.Задача,
    |    УРВ.Комментарий,
    |    УРВ.Длительность
    |ИЗ
    |    РегистрСведений.УчетРабочегоВремени КАК УРВ
    |ГДЕ
    |    УРВ.Пользователь = &Пользователь
    |    И УРВ.Дата = &Дата
    |УПОРЯДОЧИТЬ ПО
    |    УРВ.ВремяНачала";
    
    Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийСотрудник);
    Запрос.УстановитьПараметр("Дата", НачалоДня(ТекущаяДата()));
    
    ИсторияЗаСегодня.Загрузить(Запрос.Выполнить().Выгрузить());
    
КонецПроцедуры

&НаСервере
Функция ПолучитьТипПерерыв()
    Возврат Перечисления.ТипЗаписиВремени.Перерыв;
КонецФункции

&НаСервере
Функция ПолучитьСписокТипов()
	
	СписокТипов = Новый СписокЗначений;
	
	Для Каждого ЗначениеПеречисления Из Перечисления.ТипЗаписиВремени Цикл 
		СписокТипов.Добавить(ЗначениеПеречисления);
	КонецЦикла;
	
	Возврат СписокТипов;
	
КонецФункции

&НаКлиенте
Процедура ВозобновитьПослеВыбораТипа(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт 
	
	Если ВыбранныйЭлемент = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ВозобновитьСТипом(ВыбранныйЭлемент.Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура ВозобновитьСТипом(Тип)
	
	// Закрываем перерыв
    ВремяОкончания = ТекущаяДата();
    ЗакрытьАктивнуюЗапись(СтартВремени, ВремяОкончания);
	
	
    // Стартуем новую запись с предыдущим типом
    НовыйСтарт	 = ТекущаяДата();
    СтартВремени = НовыйСтарт;
	ТекущийТип	 = Тип;
	
	СохранитьЗапись(СтартВремени, '0001-01-01', 
	ТекущийТип, ТекущаяЗадача, ТекущийКомментарий);
	
	ОбновитьИсториюНаСервере();
	
	Элементы.НажатьВозобновить.Видимость = Ложь;
	
КонецПроцедуры

#КонецОбласти
